{"data":{"allGooglePeTsusecaserepositorySheet":{"nodes":[{"uniqueId":1,"who":"AUSTRAC","sector":"Finance","description":"Developing federated system to identify suspicious financial activities carried out by individuals or groups across a number of financial institutions. Aim to be able to gather insights from over 100 million accounts."},{"uniqueId":2,"who":"Duality Technologies","sector":"Health and Social Care","description":"A framework for genome-wide association studies that leverages homomorphic encryption to keep medical and genomic data secure. The framework has been applied to conduct GWAS of age-related macular degeneration on a dataset of over 25,000 individuals. The sytem is ~30 times faster than state of the art GWAS schemes based on multi-party computation."},{"uniqueId":3,"who":"NHS Digital/Privitar","sector":"Health and Social Care","description":"A system for linking patient data held across different NHS domains. To protect patient confidentiality, identifiers (such as a patient's NHS number) are pseudonymised through tokenisation. For additional security, the tokenisation differs between different NHS domains. To link data about a patient held in two domains requires first removing the tokenisation, which would expose personal information. To avoid this, a partially homomorphic encryption scheme is used which enables data to be linked without revealing the underlying raw identifiers."},{"uniqueId":4,"who":"Google","sector":"Health and Social Care","description":"A publicly available resource of statistics and visualisations intended to show the changes in the population’s mobility habits in response to COVID-19 interventions, based on location data from Google users opted in to location history tracking. Differential privacy is used to protect two metrics: the details of the location a user visited, and the number of visits the user made to each location."},{"uniqueId":5,"who":"Estonian Association of Information Technology and Telecommunications","sector":"Other","description":"Calculating industry-level performance indicators without individual organisations having to reveal their data"},{"uniqueId":6,"who":"Google","sector":"Digital","description":"Federated learning of the next-word prediction model in Google GBoard. Ensures data is not collected centrally, whilst developing a more accurate a personalised model."},{"uniqueId":7,"who":"Danisco and the association of sugar beet growers","sector":"Other","description":"Sugar beet farmers in Denmark have contracts determining how much beet they produce. Beet all goes to Danisco, the only sugar producer in Denmark. EU significantly reduced beet subsidies, meaning the country needed to develop a competitive market for trading production rights. System developed allowing confidential bidding to compute a trading price based on supply and demand. Enabled production quota to be redistributed accordingly. First large-scale application of MPC."},{"uniqueId":8,"who":"Microsoft","sector":"Digital","description":"The Confidential Consortium Blockchain Framework is a foundation for a blockchain network, securing transaction information such that only specific members of the network can access confidential information. Other network members can use remote attestation to confirm that the code being run to compute the transactions is what they expect"},{"uniqueId":9,"who":"US Census Bureau","sector":"Other","description":"Bureau is aiming to use DP across the organisation. This includes published statistics from the 2020 Census. An interesting use case in the challenges of using DP, as they find some methods of introducing noise make outputs useless, and setting the privacy budget appropriately is far from trivial.\n\nAlso see OnTheMap"},{"uniqueId":10,"who":"Apple/Google contact tracing API","sector":"Health and Social Care","description":"OS-level API for contact tracing apps to anonymously track close contacts using bluetooth proximity data. "},{"uniqueId":11,"who":"OpenSAFELY","sector":"Health and Social Care","description":null},{"uniqueId":12,"who":"Tsinghua University and Microsoft","sector":"Health and Social Care","description":"Medical Named Entity Recognition is an NLP task which aims to identify entities (e.g. drug names, symptoms) from unstructured medical texts (e.g. patient records, doctor's notes). Developed FedNER system to train NLP model in a federated way, since medical data required is confidential. Interestingly, enables different medical platforms storing information in different ways to be used, by decomposing the model into a private, local model, and a shared model. In this way, able to utilise more data, and produce more accurate results."},{"uniqueId":13,"who":"Facebook","sector":"Digital","description":null},{"uniqueId":14,"who":"Apple","sector":"Digital","description":"Siri"},{"uniqueId":15,"who":"Google","sector":"Digital","description":"GBoard"},{"uniqueId":16,"who":"Signal","sector":"Digital","description":"Signal is a privacy-focused IM app, which goes to great lengths to protect user privacy. One example is their use of Intel SGX (some of which appears to be using Azure's Confidential Compute) to ensure contact information can be uploaded to the app without Signal ever being able to view it"},{"uniqueId":17,"who":"Nvida","sector":"Health and Social Care","description":null},{"uniqueId":18,"who":"Google Chrome","sector":"Digital","description":null},{"uniqueId":19,"who":"TNO","sector":"Health and Social Care","description":"Identifying heart failure risks with Multi-Party Computation"}]}}}